test/multiphase/reactingTwoPhaseEulerFoam/populationBalance/drift/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

options
{
    massSource
    {
        type            scalarSemiImplicitSource;

        selectionMode   all;
        volumeMode      specific;

        injectionRateSuSp
        {
            thermo:rho.air      (0.024535 0);// kg/s/m³
            thermo:rho.water    (-24.535 0); // kg/s/m³
        }
    }
}


// ************************************************************************* //
